fonecmid-diplom/src/InformationRegisters/ВКМ_ДокументыСозданныеМассовымСозданиемАктов/ВКМ_ДокументыСозданныеМассовымСозданиемАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ДокументыСозданныеМассовымСозданиемАктов</name>
  <resources>
    <name>ВКМ_Реализация</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_ПериодДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>ВКМ_Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_Специалисты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ВыполненныеРаботы</name>
    <attributes>
      <name>ВКМ_ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ЧасыКОплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CommonModules/ВКМ_ОбщийМодуль/Module.bsl
#Область СлужебныеПроцедурыИФункции
Функция СоздатьАкты(ПериодМесяц, Организация) Экспорт 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Договор КАК ВКМ_Договор,
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Клиент КАК ВКМ_Клиент,
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Договор.Организация КАК ВКМ_ДоговорОрганизация
		|ПОМЕСТИТЬ ВтДоговоры
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Проведен
		|	И ВКМ_ОбслуживаниеКлиента.ВКМ_Договор.ВидДоговора = &ВидДоговора
		|	И (ВКМ_ОбслуживаниеКлиента.ВКМ_Договор.ВКМ_ДатаОкончанияДействияДоговора > &Период
		|			ИЛИ ВКМ_ОбслуживаниеКлиента.ВКМ_Договор.ВКМ_ДатаОкончанияДействияДоговора = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|	И ВКМ_ОбслуживаниеКлиента.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Договор,
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Клиент,
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Договор.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_ДокументыСозданныеМассовымСозданиемАктов.ВКМ_Реализация КАК Реализация,
		|	ВтДоговоры.ВКМ_Договор КАК Договор,
		|	ВтДоговоры.ВКМ_Клиент КАК Контрагент,
		|	ВтДоговоры.ВКМ_ДоговорОрганизация КАК Организация
		|ИЗ
		|	ВтДоговоры КАК ВтДоговоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_ДокументыСозданныеМассовымСозданиемАктов КАК ВКМ_ДокументыСозданныеМассовымСозданиемАктов
		|		ПО (ВКМ_ДокументыСозданныеМассовымСозданиемАктов.ВКМ_ПериодДокумента = &Период)
		|			И ВтДоговоры.ВКМ_Договор = ВКМ_ДокументыСозданныеМассовымСозданиемАктов.ВКМ_Договор";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", ПериодМесяц); 
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ПериодМесяц));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ПериодМесяц));
	
	МассивСтруктурРезультат = Новый Массив;
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
	
		Для Каждого ТекДоговор Из РезультатЗапроса Цикл 
			Если ЗначениеЗаполнено(ТекДоговор.Реализация) Тогда  
			Продолжить;
		КонецЕсли; 
		
		НовыйЗаказПокупателя = Документы.ЗаказПокупателя.СоздатьДокумент(); 
		НовыйЗаказПокупателя.Заполнить(Неопределено);
		НовыйЗаказПокупателя.Дата = ПериодМесяц;
		ЗаполнитьЗначенияСвойств(НовыйЗаказПокупателя, ТекДоговор);
		
		НачатьТранзакцию();
		
		Попытка  
			НовыйЗаказПокупателя.Записать(РежимЗаписиДокумента.Проведение);
		Исключение  
			ЗаписьЖурналаРегистрации("Ошибка при создании заказа покупателя", УровеньЖурналаРегистрации.Ошибка,,,"Ошибка - " + Строка(ОписаниеОшибки()));
			ОтменитьТранзакцию();
			Продолжить;
		КонецПопытки; 
		
		НовыйДокументРеализации = Документы.РеализацияТоваровУслуг.СоздатьДокумент(); 
		НовыйДокументРеализации.Заполнить(НовыйЗаказПокупателя.Ссылка);
		НовыйДокументРеализации.Дата = ПериодМесяц;
		НовыйДокументРеализации.Основание = НовыйЗаказПокупателя.Ссылка;
		НовыйДокументРеализации.ВКМ_ВыполнитьАвтозаполнение(); 
		
		Если Не НовыйДокументРеализации.ПроверитьЗаполнение() Тогда  
			ОтменитьТранзакцию();
			Продолжить;
		КонецЕсли;  
		
		Если НовыйДокументРеализации.Товары.Количество() <= 0 Тогда  
			ОтменитьТранзакцию();
			Продолжить;
		КонецЕсли;
		
		Попытка   
			НовыйДокументРеализации.Записать(РежимЗаписиДокумента.Проведение);
		Исключение  
			ЗаписьЖурналаРегистрации("Ошибка при создании реализации", УровеньЖурналаРегистрации.Ошибка,,,"Ошибка - " + Строка(ОписаниеОшибки()));
			ОтменитьТранзакцию();
			Продолжить;
		КонецПопытки; 
		
		НоваяЗаписьРегистра = РегистрыСведений.ВКМ_ДокументыСозданныеМассовымСозданиемАктов.СоздатьМенеджерЗаписи(); 
		НоваяЗаписьРегистра.Период = НачалоДня(ТекущаяДатаСеанса());
		НоваяЗаписьРегистра.ВКМ_ПериодДокумента = ПериодМесяц;
		НоваяЗаписьРегистра.ВКМ_Реализация = НовыйДокументРеализации.Ссылка;
		НоваяЗаписьРегистра.ВКМ_Договор = НовыйДокументРеализации.Договор;
		НоваяЗаписьРегистра.Записать();
		
		ЗафиксироватьТранзакцию();
		МассивСтруктурРезультат.Добавить(Новый Структура("Договор, Реализация", НовыйДокументРеализации.Договор, НовыйДокументРеализации.Ссылка));
	КонецЦикла;

	Возврат МассивСтруктурРезультат; 
КонецФункции
#КонецОбласти
